# coding=utf-8


'''
define schema 
'''

Groups = [
    ### kj
    {'id': 500, 'name': u'科技', 'sub': [501, 502, 504, 503, ]},  
    ### sx
    {'id': 100, 'name': u'文艺', 'sub': [104, 101, 102, 103,]},
    ### sk
    {'id': 200, 'name': u'社科', 'sub': [202, 203, 204, 205, 206, 207,]},
    ### cj
    {'id': 300, 'name': u'财经', 'sub': [301, 302, 303, 304, ]},
    ### sh
    {'id': 400, 'name': u'生活', 'sub': [401, 402, 403, 404, 405, 407]}, 
] 

SubGroups = {
    ### sx
    101: {'id': 101, 'name': u'情感婚恋'},
    102: {'id': 102, 'name': u'职场社会'},
    103: {'id': 103, 'name': u'校园青春'},
    104: {'id': 104, 'name': u'小清新派'},
    ### sk
    201: {'id': 201, 'name': u'社科经典', },
    202: {'id': 202, 'name': u'文学名著', },
    203: {'id': 203, 'name': u'政治军事', },
    204: {'id': 204, 'name': u'历史国学', },
    205: {'id': 205, 'name': u'文化思想', },
    206: {'id': 206, 'name': u'传记人物', },
    207: {'id': 207, 'name': u'心理哲学', },
    ### cj
    301: {'id': 301, 'name': u'经济金融', },
    302: {'id': 302, 'name': u'投资理财', },
    303: {'id': 303, 'name': u'商业管理', },
    304: {'id': 304, 'name': u'励志成功', },
    ### sh
    401: {'id': 401, 'name': u'美容装扮', },
    402: {'id': 402, 'name': u'健康养生', },
    403: {'id': 403, 'name': u'旅游厨艺', },
    404: {'id': 404, 'name': u'时尚休闲', },
    405: {'id': 405, 'name': u'亲子母婴', },
    406: {'id': 406, 'name': u'绘本漫画', },
    407: {'id': 407, 'name': u'体育天地', },
    ### kj
    501: {'id': 501, 'name': u'计算机与互联网', },
    502: {'id': 502, 'name': u'科普读物', },
    503: {'id': 503, 'name': u'汽车与车辆', },
    504: {'id': 504, 'name': u'游戏天地', },            
}
    
                              